{
	"projects": [
		{
			"id": "nobschef",
			"title": "nobschef.com",
            "type": "Web",
            "description": "No BS Chef is a recipe website that is only about sharing recipes and nothing else. No need to wade through endless blogs and stories just to find a recipe that works for you - just scroll through or search for something you like and get cooking right away!",
			"skills": [
				"HTML5",
				"CSS3",
				"JS",
				"NodeJS",
				"MongoDB"
			],
            "text": [
				"This website is a passion project of mine that I wanted to develop to help me when I'm in the kitchen.",
				"As someone who likes to cook but often struggles to remember the specific requirements of recipes (even ones I've cooked dozens of times before!), I rely quite heavily on written recipes to support the cooking process. For me, I really just want to know how much of each ingredient I require, and how long to cook different parts of the recipe.",
				"Now, I could just use a written diary - which I do when coming up with my own recipes or when modifying existing recipes for my own twist - but for the rest of it I need to find recipes somewhere, and that somewhere is the internet.",
				"One of my major pet peeves about this though is how difficult it is to find a recipe that I like without having to wade through neverending stories about sentimental experiences the author has with this particular recipe - I really just want to know how long to cook something, seriously!",
				"Enter No BS Chef - it's my attempt to create an online cooking resource for myself and countless other like-minded individuals who just want to cook. This website prioritises the user experience above all else. This means that I will strive to keep this a free platform, devoid of instrusive advertisements and dodgy subscription services.",
				"I've developed this using NodeJS to handle the server-side content delivery and a NoSQL database in the form of MongoDB to contain all of the recipes. This website is also using a collection of plugins like ExpressJS to handle dynamic page generation too.",
				"Currently I am running this in my own scalable 'data center' of sorts which is running a collection of servers and softwares like Docker/Kubernetes, though my intention is to move this to AWS if it starts seeing more traffic than my network can handle.",
				"This website is currently under-construction, though it is live with a limited set of recipes now if you wanted to give it a go. If you have any feedback, please feel free to contact me at contact@msrour.me and I would be happy to hear it!"
			],
			"clickable": true,
            "wip": true,
			"hidden": false
		},
		{
			"id": "forlorn",
			"title": "Forlorn Colonists",
            "type": "Game",
            "description": "Forlorn Colonists is a 1 to 4 player couch co-op with top-down, twin stick shooter mechanics, set in a far future sci-fi world. Currently in the prototyping stage are are actively polishing game mechanics and creating additional art assets in preparation for crowd-funding.",
			"skills": [
				"UE5",
				"CPP"
			],
            "text": [
				"TEMP",
				"TEMP",
				"TEMP",
				"TEMP",
				"TEMP",
				"TEMP",
				"TEMP"
			],
			"clickable": false,
            "wip": true,
			"hidden": false
		},
		{
			"id": "nightwatch",
			"title": "The Nightwatch",
            "type": "Game",
            "description": "In a world where humans hold a totalitarian rule, you play as a cat in a skilled group of street animals trying to rescue your crew to take down this human authority. Using turn-based tactical RPG style combat, you must strategically use special abilities unique to each animal to succeed!",
			"skills": [
				"UE4",
				"CPP"
			],
            "text": [
				"Our game is a turn-based strategy RPG, with stealth aspects interwoven into the gameplay. We intend to target people who enjoy story focused games in these genres, such Fire Emblem and some Final Fantasy games. This subset of the audience will be enticed by a game with a compelling narrative so as to pull players back to finish the story."
			],
			"clickable": true,
            "wip": false,
			"hidden": false
		},
		{
			"id": "afroDisco",
			"title": "Afro Disco",
            "type": "Game",
            "description": "Afro Disco! The game where you dance your friends into submission. From University project to passion endeavour, Afro Disco is a fully fledge game in which chess meets bejeweled. Line up your dancers to outperform your friends!",
			"skills": [
				"Unity",
				"CSharp",
				"Maya",
				"Photoshop"
			],
            "text": [
				"The gameplay of Afro Disco is unlike what you might see in a strategy game or in a 'dance' game. It revolves around setting your dancers up in specific permutiations to perform dance moves (hence the Bejeweled analogy) that shove your opponents from the dance board. Some dance moves require you to use your lead dancer to 'take lead' and therefore require more setup to perform with a greater reward. Some moves push, move moves pull, some moves shuffle and some moves throw dancers, and the whole goal of the game is to eliminate either 3 out of 5 dancers or shove your opponents lead dancer off the dance floor.",
				"Afro Disco started as a University project among friends for one of our game design classes. Given the whole semester to make a game, we began work immediately creating this disco dance game. The idea for the name comes from the fact that two of our members have afros and as a result of game design classes prior.",
				"My role in the group is as the project manager and the lead artist. All of the art assets were created by me except for the character models as that is one of my weaknesses in modeling.",
				"The game is currently set for release on the 15th of February 2018, though after that date we will likely continue to keep working on the game throughout the year providing free updates and dlc. Currently the game is set to only make a debut on Android but perhaps we will aim to get dev rights on iOS and even release on steam some day."
			],
			"clickable": true,
            "wip": false,
			"hidden": false
		},
		{
			"id": "portfolio",
			"title": "msrour.me Portfolio",
            "type": "Web",
            "description": "From a tiny html page to a full-stack application, my portfolio is the place to see everything about my professionally.",
			"skills": [
				"HTML5",
				"CSS3",
				"JS",
				"NodeJS",
				"MongoDB"
			],
            "text": [
				"This is a bit of web-ception, isn't it?",
				"This website started as a place for me to put up my various university assignments, and I was only making it to be eligible to apply to a particularly strict unit that I wanted to study. I required a website portfolio, so I made one. Now at the time, this website was honestly not great, especially since I threw it all together in the space of a weekend while working on other assignments, but since then it has slowly progressed into what it is today.",
				"In mid-2022, I decided that I wanted to learn full-stack web development so that I could have a website that mirrored my resume so that it would be more accessible. I already had my resume in a LaTeX format, so I created some python scripts to convert raw content into HTML using a set of templates. From this, I now had a website that would mirror my resume, and a website I could genuinely be proud of.",
				"Around this time, I also started developing NoBSChef.com which took everything a step further, and it's at this point that I took the plunge to making the website completely dynamically generated using NodeJS and MongoDB to store all of the project details."
			],
			"clickable": true,
            "wip": false,
			"hidden": false
		},
		{
			"id": "adTrailer",
			"title": "Afro Disco Trailer",
            "type": "AV",
            "description": "For the Afro Disco game I am making, I decided to have a go at making a trailer for the game. This is one of my first public works, whereas most of my other vidios have been small school projects or other personal projects.",
			"skills": [
				"Premiere",
				"Audition"
			],
            "text": [
				"Creating a trailer for Afro Disco was born out of the desire to actually use my videoediting knowledge/skill to actually make something that will be seen by the world. Also because it was required for grades... But regardless, I really wanted to make this trailer in my own time. This is one of my first attempts at making something that would potentially be seen by friends, family, and even future employers so I spent a lot of time going through all the steps in the creative process to get to the final product, including a lot of storyboarding.",
				"This is by no means the final version of the trailer. For now I am leaving it as it is, despite the progress on the game, as I think it would be useless to record so much in game footage only to have to redo the entire thing. As such, I will be waiting until the final few days of the development cycle to add new footage and hopefully make a fantastic display for our game."
			],
			"clickable": true,
            "wip": false,
			"hidden": true
		},
		{
			"id": "3dBank",
			"title": "Bank Environment",
            "type": "3D",
            "description": "After learning how to work with normal/displacement/height maps, I was tasked with creating an environment that was heavily optimised to run at high fps. This features a marble bank and fountain courtyard.",
			"skills": [
				"Unity",
				"Maya",
				"Photoshop"
			],
            "text": [
				"This was my second attempt at working on an environment. I wanted to make the building the main focus of the scene and thus spent most of my time creating creating a very convincing and life like building. I also spent a bunch of time experimenting with perticle effcts to make a lovely fountain in the middle of the courtyard.",
				"Because I was limiting myself to a lower polygon count (roughly below 60,0000 tris), I couldn't waste too much on the trees and vegitation and thus settled on the lower quality versions that ended up making the scene. I also sourced all of my textures myself, except for the trees, which cut into the time I had available to create this project."
			],
			"clickable": true,
            "wip": false,
			"hidden": false
		},
		{
			"id": "3dTaipei",
			"title": "Taipei 101 Environment",
            "type": "3D",
            "description": "This was one of my first 3D environments that I made. Using more advanced texturing and UV mapping, I made the models in Maya and transfered everything into Unity to have a explorable environment.",
			"skills": [
				"Unity",
				"Maya",
				"Photoshop"
			],
            "text": [
				"As an avid fan of architecture and civil engineering, the Taipei 101 is one of my favourite buildings, alongside the Burj Khalifa in Dubai and Petronas Towers Kuala Lumpur, hence why I chose to model it for one of my 3D modelling assignments at university. I wanted to test how abilities by creating an architectural model in Maya as opposed to software that might be more suited to it, such as Fusion 360 or other CADs.",
				"The inpirations for the environment was primarily the Taipei 101 building, George Orwell's '1998', and 'Half-Life 2'. I wanted to give the feeling of a dystopian area or even an abandoned one, so I littered the streets with large, wrought iron barricades (similar to those you would find in Half-Life) and put tall, looming buildings with few features on them to give an unsettling feeling.",
				"As one of my first environments in Maya, I ended up spending a lot of time trying to create the supplimentary buildings which ended up not looking as well as I hoped, leaving me with less time to focus on set dressing and other small details before the deadline came up."
			],
			"clickable": true,
            "wip": false,
			"hidden": true
		},
		{
			"id": "cppEngine",
			"title": "Custom C++ Engine",
            "type": "Game",
            "description": "Using Direct X rendering and the Windows API, this C++ game engine was built from scratch and used to create a clone of 'Super Hot'. A lot of time was also spent with Pixel Shaders and other graphics elements.",
			"skills": [
				"C",
				"CPP"
			],
            "text": [
				"Using the basic DirectX template in Visual Studio, the aim of this project was to gather an understanding of the underlying qualities of a game engine such as Unity or UE4. The goal was to create a simple game (Super Hot) completely from scratch, including the creation of shaders and class structures.",
				"The main concern starting out was that the engine would not be expandable enough going down teh line, so I ended up spending a lot of time creating the basic features that would later on allow me to create more advanced materials and game logic. I also wanted to play around with multiplayer to some extent, though I eventually stumbled into issue after issue making it nearly impossible to implement, though I still managed to implement a simple in-game chat that I later repurposed to a cheat-code tool, allowing players to play around with limited constraints. I even made the frameworks for a 'cheatcode engine' that would allow people to embed their own cheats into the game"
			],
			"clickable": true,
            "wip": false,
			"hidden": true
		},
		{
			"id": "eurekaAnimation",
			"title": "Eureka Animation",
            "type": "3D",
            "description": "A character animation I made.",
			"skills": [
				"Unity",
				"Maya",
				"Photoshop"
			],
            "text": [
				"TEMP"
			],
			"clickable": false,
            "wip": false,
			"hidden": true
		},
		{
			"id": "3dWyvern",
			"title": "Wyvern",
            "type": "3D",
            "description": "A creature character I made.",
			"skills": [
				"Maya",
				"Photoshop"
			],
            "text": [
				"TEMP"
			],
			"clickable": false,
            "wip": false,
			"hidden": true
		},
		{
			"id": "3ds",
			"title": "3DS Model",
            "type": "3D",
            "description": "My first creation in Maya, the 3DS was my way of experimenting with creating objects in Maya and working with textures and lighting techniques.",
			"skills": [
				"Maya"
			],
            "text": [
				"As my first attempt in 3D modelling in Maya, I was challenged by the modelling process because of how different it is so how it might be done in Fusion360 or in other CAD software (which is where all of my experience came from prior). Because this was a part of an assignment in one of my university classes, I spent a lot of time and attention on the finer detail, trying to really make it seem as though this could pass as promotional material for the offical 3DS.",
				"One of my major focuses was on the lights and specifically trying to make them seem as though they are legitimate lights in the renders. It took a lot of trial and error and plenty of time just trying to figure out how to get these things working in a new program, but eventually I think I got it looking quite good. One of my primary struggles though were with text and other surface elements because at the time I had not yet learned how to UV map and propoerly texture, and therefore that entire segment was done quite crudely with small 3D meshes. If I were to redo this project, I would make sure to put time into making the UVs as well as possible so that there isn't any shearing on the textures."
			],
			"clickable": true,
            "wip": false,
			"hidden": false
		},
		{
			"id": "bookcovers",
			"title": "Bookcover Redesigns",
            "type": "Design",
            "description": "Tasked with redeseigning some bookcovers, I took two concepts and developed these based off them. These were done solely in Photoshop with much of the time spent reiterating on each design.",
			"skills": [
				"Photoshop"
			],
            "text": [
				"TEMP"
			],
			"clickable": false,
            "wip": false,
			"hidden": true
		},
		{
			"id": "lozKey",
			"title": "Photoshop Test Pieces",
            "type": "Design",
            "description": "Various compositions I have made in Adobe Photoshop to test my skills and develop new ones.",
			"skills": [
				"Photoshop",
				"Illustrator"
			],
            "text": [
				"TEMP"
			],
			"clickable": false,
            "wip": false,
			"hidden": true
		},
		{
			"id": "sokolovs",
			"title": "Sokolov's Elixer 3D Print",
            "type": "3D",
            "description": "This was one of my first successful 3D printed objects that I made early on. The model is from the game, Dishonored, which I took a liking to immediatedly.",
			"skills": [
				"Fusion360"
			],
            "text": [
				"After doing plenty of work in 3D modelling and 3D printing before in Google Sketchup, I finally decided to make the switch to Fusion 360 and to learn how to use more professional grade software to create 3D models. Sokolov's Elixer from Dishonored was a perfect object to start with due to its straight sides and symetrical shape, meaning it was quite easy to make and made learning Fusion 360 extremely easy.",
				"This piece was commissioned by a user of the 3D printing website/storefront, <a href=\"https://www.shapeways.com\">Shapeways.com</a>, after which I had created this for her over the course of a day. It printed flawlessly and was perfectly accepted a 150x25mm test tube that would hold the red liquid and imitate the in-game object."
			],
			"clickable": true,
            "wip": false,
			"hidden": true
		}
	]
}